src/CF/InformationRegisters/ЗначенияДополнительныхРеквизитов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияДополнительныхРеквизитов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеРеквизита</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>1020</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ОбъектВладелец</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДополнительныйРеквизит</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДополнительныеРеквизиты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/CF/Catalogs/ДополнительныеРеквизиты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Catalog>
		<Properties>
			<Name>ДополнительныеРеквизиты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЭтоРеквизитДляОбъекта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОбъектыДляДополнительныхРеквизитов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеОбъектаВладельца</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДополнительногоРеквизита</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДополнительныхРеквизитов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>1020</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Периодический</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1020</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CF/InformationRegisters/ЗначенияДополнительныхРеквизитов/Forms/ФормаСписка/Ext/Form/Module.bsl
//sza140509-0126 SZA: 
//sza140106-2315 : 

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 0);
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 1);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не Отказ тогда
	Если ЗначениеЗаполнено(Параметры.ОбъектВладелец) Тогда
		ОбъектВладелец = Параметры.ОбъектВладелец;
		НаименованиеОбъектаВладельца = сокрлп(типзнч(ОбъектВладелец));
		
		ПроверитьНаличиеВсехРеквизитов();
		
	Иначе
		Элементы.ОбъектВладелец.Видимость = Истина;
		Элементы.ГруппаГоризонт.Видимость = Истина;
	КонецЕсли;
	
	Список.Параметры.УстановитьЗначениеПараметра("НетОтбораПоОбъектВладелец", НЕ ЗначениеЗаполнено(ОбъектВладелец));
	Список.Параметры.УстановитьЗначениеПараметра("ОбъектВладелец", ОбъектВладелец);
	
	Наименование = ОбщийМодульПовтор.ПолучитьКрасивоеНаименованиеОбъекта(НаименованиеОбъектаВладельца);
	
	элементы.ДобавитьДополнительныйРеквизит.Заголовок = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Добавить дополнительный реквизит для") + " " + Наименование;
	элементы.ОбъектВладелец1.Заголовок = Наименование;
		ОбщийМодульСервер.ОбеспечитьСписокОтборов(Список);	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьНаличиеВсехРеквизитов()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ДополнительныеРеквизиты.Ссылка,
	|	ДополнительныеРеквизиты.ТипДополнительногоРеквизита,
	|	ДополнительныеРеквизиты.ЗначениеПоУмолчанию
	|ИЗ Справочник.ДополнительныеРеквизиты КАК ДополнительныеРеквизиты
	|ГДЕ ДополнительныеРеквизиты.НаименованиеОбъектаВладельца = &НаименованиеОбъектаВладельца
	|	И ДополнительныеРеквизиты.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("НаименованиеОбъектаВладельца", НаименованиеОбъектаВладельца);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();		
		
		ЗапросЗначения = Новый Запрос;
		ЗапросЗначения.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1 ЗначенияДополнительныхРеквизитовСрезПоследних.ЗначениеРеквизита
		|ИЗ РегистрСведений.ЗначенияДополнительныхРеквизитов.СрезПоследних КАК ЗначенияДополнительныхРеквизитовСрезПоследних
		|ГДЕ ЗначенияДополнительныхРеквизитовСрезПоследних.ОбъектВладелец = &ОбъектВладелец
		|	И ЗначенияДополнительныхРеквизитовСрезПоследних.ДополнительныйРеквизит = &ДополнительныйРеквизит";
		ЗапросЗначения.УстановитьПараметр("ОбъектВладелец", ОбъектВладелец);
		
		ДатаПервогоДокумента = ОбщийМодульСервисСервер.ДатаПервогоДокумента();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ДополнительныйРеквизит  = ВыборкаДетальныеЗаписи.ссылка;
			ЗапросЗначения.УстановитьПараметр("ДополнительныйРеквизит", ДополнительныйРеквизит);
			
			РезультатЗапросЗначения = ЗапросЗначения.Выполнить();
			если РезультатЗапросЗначения.Пустой() тогда
				
				ДопРеквизит = РегистрыСведений.ЗначенияДополнительныхРеквизитов.СоздатьМенеджерЗаписи();
				ДопРеквизит.Активность = Истина;
				ДопРеквизит.ДополнительныйРеквизит = ДополнительныйРеквизит;
				ДопРеквизит.ЗначениеРеквизита = ВыборкаДетальныеЗаписи.ЗначениеПоУмолчанию;
				ДопРеквизит.ОбъектВладелец    = ОбъектВладелец;
				ДопРеквизит.Период			  = ДатаПервогоДокумента;
				
				Попытка //Записи в регистр сведений 
					ДопРеквизит.Записать(Истина);
					
				Исключение 
				КонецПопытки; 
				
			КонецЕсли;
			
		КонецЦикла;                        	
	КонецЕсли;
	
КонецПроцедуры //ПроверитьНаличиеВсехРеквизитов

&НаКлиенте
Процедура ДобавитьДополнительныйРеквизит(Команда)
	
	параметрыФормы = Новый Структура("ОбъектВладелец", ОбъектВладелец);
	ФормаНовогоДопРеквизита = ПолучитьФорму("Справочник.ДополнительныеРеквизиты.ФормаОбъекта", параметрыФормы);
	ФормаНовогоДопРеквизита.открытьмодально();
	ПроверитьНаличиеВсехРеквизитов();
	
КонецПроцедуры
